app/controllers/themes_controller.rb

  def index
    @themes = Theme.all
---
SELECT "themes".* FROM "themes"

    def set_theme
      @theme = Theme.find(params[:id])
---
SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]