app/controllers/work_controller.rb

  def index
    @images_count = Image.all.count
    # @selected_theme = "Select theme to leave your answer"
    @selected_theme = t('.def_select_theme')
    @selected_image_name = ''
    @values_qty = Value.all.count
---
SELECT COUNT(*) FROM "images"
SELECT COUNT(*) FROM "values"

  def choose_theme

    # @current_locale = params[:locale]
    # logger.info "In WorkController#choose_theme @@current_locale = #{@current_locale}"
    # session[:current_locale] = @current_locale

    @themes = Theme.all.pluck(:name)
---
SELECT "themes"."name" FROM "themes"

  def display_theme
    logger.info "In work#display_theme"
    @image_data = {}
    I18n.locale = session[:current_locale]

    current_user_id = 0 #current_user.id
    if params[:theme] == "-----" #.blank?
      theme = t(".select_theme") #"Select theme to leave your answer"
      theme_id = 1
      values_qty = Value.all.count.round
---
SELECT COUNT(*) FROM "values"